export const orderCreationSteps = [
  { key: 'ASK_DATE', message: '📅 Укажите дату, когда нужно присмотреть за вашим ребенком?' },
  { key: 'ASK_TIME', message: '⏰ Укажите время начала и окончания визита няни?' },
  {
    key: 'ASK_DURATION',
    message:
      '⏱️ **Проверьте длительность**: {calculated_hours} ч.\n\n✅ _Если всё верно - нажмите "Подтвердить"\n✏️ Или введите другое количество часов_',
  },
  { key: 'ASK_CHILD', message: '👶 Укажите имя и возраст ребенка:' },
  {
    key: 'ASK_TASKS',
    message:
      '📝 Опишите какая именно помощь нужна:\n• Будете ли вы дома вовремя визита или хотите отлучиться?\n• Будут ли дополнительные задачи (приготовление пищи, отвезти/забрать с секции)?',
  },
  { key: 'ASK_ADDRESS', message: '🏠 Укажите адрес куда нужно приехать:' },
  { key: 'CONFIRM_ORDER', message: '✅ ВАШ ЗАКАЗ' },
];

export const parentFsmSteps = [
  {
    key: 'ASK_ROLE',
    message: 'Выберите вашу роль:',
    field: null,
    options: {
      reply_markup: {
        inline_keyboard: [
          [{ text: 'Родитель', callback_data: 'PARENT' }],
          [{ text: 'Няня', callback_data: 'NANNY' }],
        ],
      },
    },
  },
  /*{
        key: 'ASK_PHONE',
        message: 'Пожалуйста, поделитесь своим номером телефона:',
        field: 'phone',
        options: {
          reply_markup: {
            keyboard: [[{ text: 'Поделиться номером', request_contact: true }]],
            one_time_keyboard: true,
            resize_keyboard: true,
          },
        },
      },*/
  {
    key: 'ASK_NAME',
    message: 'Введите ваше имя:',
    field: 'fullName',
  },
  {
    key: 'ASK_CONSENT',
    message:
      'Минутка формальности. Подтвердите согласие с условиями обработки персональных данных.',
    field: null, // просто кнопка или чекбокс
    options: {
      reply_markup: {
        inline_keyboard: [[{ text: 'Согласен', callback_data: 'consent_yes' }]],
      },
    },
  },
  {
    key: 'ASK_CHILD_NAME',
    message: 'Введите имя вашего ребёнка:',
    field: 'name',
  },
  {
    key: 'ASK_CHILD_AGE',
    message: 'Укажите возраст вашего ребёнка:',
    field: 'age',
  },
  {
    key: 'ASK_CHILD_NOTES',
    message: 'Расскажите о особенностях вашего ребёнка (аллергии, привычки и т.д.):',
    field: 'notes',
    options: {
      reply_markup: {
        inline_keyboard: [[{ text: 'Пропустить', callback_data: 'skip_child_notes' }]],
      },
    },
  },

  {
    key: 'FINISH',
    message: '✅ Регистрация завершена! Теперь вы можете искать няню.',
    field: null,
    options: {
      reply_markup: {
        inline_keyboard: [[{ text: 'Найти няню', callback_data: 'search_nanny' }]],
      },
    },
  },
];
